import streamlit as st
import pandas as pd
 
menu = st.sidebar.radio('***',
    ("Сетка в Gmsh", 
    "Параметры сеток",
    "Визуализации сетки",    
    )
)

if menu == "Сетка в Gmsh":
    r"""
    ##### Сетка в Gmsh    

    """
    
    code = """  
    // Параметры прямоугольника
    L = 2;      // Ширина прямоугольника
    H = 1;      // Высота прямоугольника

    // Параметры кругового выреза
    r = 3./16;  // Радиус круга
    l = 3./4;   // X-координата центра круга
    h = 1./2;   // Y-координата центра круга

    // Размеры сетки
    N = 5;     // Количество точек на границе
    d = H/N;    // Размер сетки по ширине канала
    dd = 0.2*d; // Размер сетки на окружности

    // Точки для прямоугольника
    Point(1) = {0, 0, 0, d};
    Point(2) = {L, 0, 0, d};
    Point(3) = {L, H, 0, d};
    Point(4) = {0, H, 0, d};

    // Линии для прямоугольника
    Line(1) = {1, 2};  // Нижняя граница
    Line(2) = {2, 3};  // Правая граница
    Line(3) = {3, 4};  // Верхняя граница
    Line(4) = {4, 1};  // Левая граница

    // Точки для круга
    Point(5) = {l, h, 0, dd};
    Point(6) = {l + r, h, 0, dd};
    Point(7) = {l, h + r, 0, dd};
    Point(8) = {l - r, h, 0, dd};
    Point(9) = {l, h - r, 0, dd};

    // Дуги для круга
    Circle(5) = {6, 5, 7};
    Circle(6) = {7, 5, 8};
    Circle(7) = {8, 5, 9};
    Circle(8) = {9, 5, 6};

    // Контур прямоугольника
    Line Loop(1) = {1, 2, 3, 4};

    // Контур круга
    Line Loop(2) = {5, 6, 7, 8};

    // Плоская поверхность с вырезом
    Plane Surface(1) = {1, 2};

    // Физические линии для границ
    Physical Line("1") = {1};           // Нижняя граница
    Physical Line("2") = {3};           // Верхняя граница
    Physical Line("3") = {4};           // Левая граница
    Physical Line("4") = {2};           // Правая граница
    Physical Line("5") = {5, 6, 7, 8};  // Граница круга

    // Физическая поверхность
    Physical Surface("1") = {1};

    // Настройка сетки
    Mesh.CharacteristicLengthMin = dd;
    Mesh.CharacteristicLengthMax = d;

    """ 
    st.code(code, language="gmsh") 
    
if menu == "Параметры сеток":
    r"""
    ##### Параметры сеток
    
    """

    data = {
        "Сетка": [1, 2, 3],
        "Число разбиений": [5, 10, 20],
        "    Число ячеек": [350, 1180, 4474],
        "    Число узлов": [206, 650, 2357]        
    }
    df = pd.DataFrame(data)

    st.table(df)
    

    
if menu == "Визуализации сетки":
    r"""
    ##### Визуализации сетки
    
    """
    
    tab1, tab2, tab3 = st.tabs([" Сетка 1 ", " Сетка 2 ", " Сетка 3 "])

    with tab1: 
        st.image("pages/figs/s-1.png")
    with tab2:
        st.image("pages/figs/s-2.png")
    with tab3:
        st.image("pages/figs/s-3.png")


